cf/DataProcessors/ElectronicDocumentsExchangeWithBank.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ElectronicDocumentsExchangeWithBank</Name>
			<Comment>Electronic document exchange with the bank</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDAgreement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Statements</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CompanyAccount</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SendingDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BankStatement</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Enums/BankApplications.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>BankApplications</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AlphaBankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SberbankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExchangeThroughTheAdditionalInformationProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AsynchronousExchange</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iBank2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/ElectronicDocumentsExchangeWithBank/Forms/StorageSelection/Ext/Form/Module.bsl
&AtClient
Var ExternalAttachableModule;

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then
		Return;
	EndIf;
	
	If Parameters.Storages <> Undefined Then
		For Each Storage IN Parameters.Storages Do
			Items.StorageIdentifier.ChoiceList.Add(Storage);
		EndDo;
		
		If Parameters.Storages.Count() = 1 Then
			Items.StorageIdentifier.Enabled = False;
			CurrentItem = Items.Pin;
		EndIf;
	EndIf;

	
	BankApplication = CommonUse.ObjectAttributeValue(Parameters.EDAgreement, "BankApplication");
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)

	If BankApplication = PredefinedValue("Enum.BankApplications.ExchangeThroughTheAdditionalInformationProcessor") Then
		ExternalAttachableModule = ElectronicDocumentsServiceClient.ExternalConnectedModuleThroughAdditionalDataProcessor(
																										Parameters.EDAgreement);
		If ExternalAttachableModule = Undefined Then
			Cancel = True;
			Return;
		EndIf;
	EndIf;
	
	SetEnabledOfItems();
		
EndProcedure

#EndRegion

#Region HeaderFormItemsEventsHandlers

&AtClient
Procedure StorageOnChange(Item)

	SetEnabledOfItems();
	Pin = "";
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure Done(Command)
	
	If Not ValueIsFilled(StorageIdentifier) Then
		CommonUseClientServer.MessageToUser(NStr("en='Storage is not selected';ru='Не выбрано хранилище'"), , "StorageIdentifier");
		Return;
	EndIf;
	
	If Items.Pin.Enabled Then
		If BankApplication = PredefinedValue("Enum.BankApplications.ExchangeThroughTheAdditionalInformationProcessor") Then
			PinCodeSet = ElectronicDocumentsServiceClient.SetStoragePINCodeThroughAdditionalDataProcessor(
																ExternalAttachableModule, StorageIdentifier, Pin)
		Else
			PinCodeSet = ElectronicDocumentsServiceClient.SetStoragePINCodeiBank2(StorageIdentifier, Pin);
		EndIf;
	Else
		PinCodeSet = True;
	EndIf;
	
	If PinCodeSet Then
		Close(StorageIdentifier);
	EndIf;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtClient
Procedure SetEnabledOfItems()

	If ValueIsFilled(StorageIdentifier) Then
	
		If BankApplication = PredefinedValue("Enum.BankApplications.ExchangeThroughTheAdditionalInformationProcessor") Then
			Items.Pin.Enabled = ElectronicDocumentsServiceClient.RequiredToSetStoragePINCodeThroughAdditionalDataProcessor(ExternalAttachableModule, StorageIdentifier) = True
				AND Not ElectronicDocumentsServiceClient.StoragePINCodeIsSetThroughAdditionalDataProcessor(ExternalAttachableModule, StorageIdentifier) = True;
		Else
			Items.Pin.Enabled = ElectronicDocumentsServiceClient.RequiredToSetStoragePINCodeiBank2(StorageIdentifier) = True;
		EndIf;
	
	EndIf;

EndProcedure

#EndRegion
